{"totalTime": "PT1H10M", "description": "\"This is a very different banana bread recipe; it has chocolate chips, cocoa, and a touch of sour cream. Delicious!\"", "ingredients": ["1 cup margarine, softened", "2 cups white sugar", "4 eggs", "6 bananas, mashed", "2 teaspoons vanilla extract", "3 cups all-purpose flour", "2 teaspoons baking soda", "1/4 cup unsweetened cocoa powder", "1 cup lite sour cream", "1 cup semisweet chocolate chips"], "url": "http://allrecipes.com/recipe/17252/chocolate-banana-bread/", "image": "http://images.media-allrecipes.com/userphotos/720x405/996152.jpg", "cookTime": "PT1H", "recipeYield": "24", "recipeInstructions": ["Preheat oven to 350 degrees F (175 degrees C). Lightly grease two 9x5 inch loaf pans.", "In a large bowl, cream together margarine, sugar and eggs. Stir in bananas and vanilla. Sift in flour, baking soda and cocoa; mix well. Blend in sour cream and chocolate chips. Pour batter into prepared pans.", "Bake in preheated oven for 60 minutes, or until a toothpick inserted into center of a loaf comes out clean."], "prepTime": "PT10M", "name": "Chocolate Banana Bread"}
{"totalTime": "PT2H30M", "description": "\"This cake was first made for me by a friend while I was visiting her after she had delivered her 11th child. I told her, 'I should have baked for you!'\"", "ingredients": ["3/4 cup butter", "2 1/8 cups white sugar", "3 eggs", "2 teaspoons vanilla extract", "3 cups all-purpose flour", "1 1/2 teaspoons baking soda", "1/4 teaspoon salt", "1 1/2 cups buttermilk", "2 teaspoons lemon juice", "1 1/2 cups mashed bananas", "1/2 cup butter, softened", "1 (8 ounce) package cream cheese, softened", "3 1/2 cups confectioners' sugar", "1 teaspoon vanilla extract"], "url": "http://allrecipes.com/recipe/8333/banana-cake-vi/", "image": null, "cookTime": "PT1H", "recipeYield": "18", "recipeInstructions": ["Preheat oven to 275 degrees F (135 degrees C). Grease and flour a 9x13 inch pan. In a small bowl, mix mashed bananas with lemon juice, set aside. In a medium bowl, mix flour, baking soda and salt. Set aside.", "In a large bowl, cream 3/4 cup butter and 2 1/8 cups sugar until light and fluffy. Beat in the eggs one at a time, then stir in 2 teaspoons vanilla.  Beat in the flour mixture alternately with the buttermilk. Stir in banana mixture. Pour batter into prepared pan.", "Bake in preheated oven for 1 hour, or until a toothpick inserted into the center of the cake comes out clean. Remove from oven and place directly into freezer for 45 minutes. This will make the cake very moist.", "For the frosting: In a large bowl, cream 1/2 cup butter and cream cheese until smooth. Beat in 1 teaspoon vanilla. Add confectioners sugar and beat on low speed until combined, then on high until frosting is smooth. Spread on cooled cake."], "prepTime": "PT30M", "name": "Banana Cake VI"}
{"totalTime": "", "description": "\"This recipe makes a delightful banana cake packed with chocolate chips for a delightful way to enjoy a classic flavor combination.\"", "ingredients": ["1 1/2 cups all-purpose flour", "2/3 cup white sugar", "1 1/2 teaspoons baking powder", "1/4 teaspoon salt", "1 cup mashed bananas", "1 egg", "1/2 cup unsalted butter, melted", "1/4 cup milk", "3/4 cup semisweet chocolate chips"], "url": "http://allrecipes.com/recipe/8302/banana-chocolate-chip-cake/", "image": "http://images.media-allrecipes.com/userphotos/720x405/424473.jpg", "cookTime": "", "recipeYield": "24", "recipeInstructions": ["Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9x13 inch pan.", "In a large bowl, mix flour, sugar, baking powder and salt.", "In a separate bowl, combine bananas, egg, melted butter and milk.", "Stir banana mixture into flour mixture until blended. Be careful not to over mix.", "Stir in chocolate chips.", "Pour batter into 9x13 inch pan. Bake at 350 degrees F (175 degrees C) 30 to 35 minutes, or until a toothpick inserted into center of cake comes out clean. (It will have some melted chocolate, but no crumbs.)"], "prepTime": "", "name": "Banana Chocolate Chip Cake"}
{"totalTime": "PT1H20M", "description": "\"Browning the butter really adds a depth of flavor, not to mention it smells extra amazing when in the oven. This is my go-to recipe when I have ripe bananas, and has taken me a while to get it right. Enjoy it hot, fresh from the oven.\"", "ingredients": ["1/2 cup butter", "3 very ripe bananas", "1/4 cup brown sugar", "1/4 cup white sugar", "1 egg", "1 tablespoon vanilla extract", "1 1/2 cups all-purpose flour", "1 1/2 teaspoons baking soda", "1 teaspoon ground cinnamon (optional)", "1/2 teaspoon ground nutmeg (optional)"], "url": "http://allrecipes.com/recipe/242314/browned-butter-banana-bread/", "image": "http://images.media-allrecipes.com/userphotos/720x405/2253133.jpg", "cookTime": "PT50M", "recipeYield": "6", "recipeInstructions": ["Melt butter in a small saucepan over medium heat; bring to a low simmer and cook, stirring frequently, until butter is browned, fragrant, and foamy, with brown bits in it, 5 to 10 minutes. Set aside to cool to room temperature, about 15 minutes. Measure 1/3 cup of browned butter; reserve remaining browned butter for another use.", "Preheat oven to 350 degrees F (175 degrees C). Grease a loaf pan.", "Mash bananas in a large bowl; stir in brown sugar, white sugar, egg, vanilla extract, and 1/3 cup brown butter.", "Whisk flour, baking soda, cinnamon, and nutmeg together in a bowl. Fold flour mixture into banana mixture just until all ingredients are moistened; pour into prepared pan.", "Bake in the preheated oven until a toothpick inserted near the center comes out clean, about 45 minutes."], "prepTime": "PT15M", "name": "Browned Butter Banana Bread"}
{"totalTime": "PT45M", "description": "\"This is a delicious recipe for ham and potato soup that a friend gave to me. It is very easy and the great thing about it is that you can add additional ingredients, more ham, potatoes, etc and it still turns out great.\"", "ingredients": ["3 1/2 cups peeled and diced potatoes", "1/3 cup diced celery", "1/3 cup finely chopped onion", "3/4 cup diced cooked ham", "3 1/4 cups water", "2 tablespoons chicken bouillon granules", "1/2 teaspoon salt, or to taste", "1 teaspoon ground white or black pepper, or to taste", "5 tablespoons butter", "5 tablespoons all-purpose flour", "2 cups milk"], "url": "http://allrecipes.com/recipe/56927/delicious-ham-and-potato-soup/", "image": null, "cookTime": "PT25M", "recipeYield": "8", "recipeInstructions": ["Combine the potatoes, celery, onion, ham and water in a stockpot. Bring to a boil, then cook over medium heat until potatoes are tender, about 10 to 15 minutes. Stir in the chicken bouillon, salt and pepper.", "In a separate saucepan, melt butter over medium-low heat. Whisk in flour with a fork, and cook, stirring constantly until thick, about 1 minute. Slowly stir in milk as not to allow lumps to form until all of the milk has been added. Continue stirring over medium-low heat until thick, 4 to 5 minutes.", "Stir the milk mixture into the stockpot, and cook soup until heated through. Serve immediately."], "prepTime": "PT20M", "name": "Delicious Ham and Potato Soup"}
{"totalTime": "PT35M", "description": "\"The crumb topping is what makes these banana muffins stand apart from the ordinary. They're scrumptious!\"", "ingredients": ["1 1/2 cups all-purpose flour", "1 teaspoon baking soda", "1 teaspoon baking powder", "1/2 teaspoon salt", "3 bananas, mashed", "3/4 cup white sugar", "1 egg, lightly beaten", "1/3 cup butter, melted", "1/3 cup packed brown sugar", "2 tablespoons all-purpose flour", "1/8 teaspoon ground cinnamon", "1 tablespoon butter"], "url": "http://allrecipes.com/recipe/17652/banana-crumb-muffins/", "image": null, "cookTime": "PT20M", "recipeYield": "10", "recipeInstructions": ["Preheat oven to 375 degrees F (190 degrees C). Lightly grease 10 muffin cups, or line with muffin papers.", "In a large bowl, mix together 1 1/2 cups flour, baking soda, baking powder and salt. In another bowl, beat together bananas, sugar, egg and melted butter. Stir the banana mixture into the flour mixture just until moistened. Spoon batter into prepared muffin cups.", "In a small bowl, mix together brown sugar, 2 tablespoons flour and cinnamon. Cut in 1 tablespoon butter until mixture resembles coarse cornmeal. Sprinkle topping over muffins.", "Bake in preheated oven for 18 to 20 minutes, until a toothpick inserted into center of a muffin comes out clean."], "prepTime": "PT15M", "name": "Banana Crumb Muffins"}
{"totalTime": "PT1H40M", "description": "\"Everybody wants this recipe when I take them in for a carry-in. To make them award winning, my daughter, Tegan, made them for a cookie baking contest and won a red ribbon!  You can use any flavor pudding you like for this recipe.\"", "ingredients": ["4 1/2 cups all-purpose flour", "2 teaspoons baking soda", "2 cups butter, softened", "1 1/2 cups packed brown sugar", "1/2 cup white sugar", "2 (3.4 ounce) packages instant vanilla pudding mix", "4 eggs", "2 teaspoons vanilla extract", "4 cups semisweet chocolate chips", "2 cups chopped walnuts (optional)"], "url": "http://allrecipes.com/recipe/15004/award-winning-soft-chocolate-chip-cookies/", "image": null, "cookTime": "PT12M", "recipeYield": "72", "recipeInstructions": ["Preheat oven to 350 degrees F (175 degrees C). Sift together the flour and baking soda, set aside.", "In a large bowl, cream together the butter, brown sugar, and white sugar. Beat in the instant pudding mix until blended. Stir in the eggs and vanilla. Blend in the flour mixture. Finally, stir in the chocolate chips and nuts. Drop cookies by rounded spoonfuls onto ungreased cookie sheets.", "Bake for 10 to 12 minutes in the preheated oven. Edges should be golden brown."], "prepTime": "PT15M", "name": "Award Winning Soft Chocolate Chip Cookies"}
{"totalTime": "PT1H20M", "description": "\"Why compromise the banana flavor? This banana bread is moist and delicious with loads of banana flavor! Friends and family love my recipe and say it's by far the best! It's wonderful toasted!! Enjoy!\"", "ingredients": ["2 cups all-purpose flour", "1 teaspoon baking soda", "1/4 teaspoon salt", "1/2 cup butter", "3/4 cup brown sugar", "2 eggs, beaten", "2 1/3 cups mashed overripe bananas"], "url": "http://allrecipes.com/recipe/20144/banana-banana-bread/", "image": null, "cookTime": "PT1H5M", "recipeYield": "12", "recipeInstructions": ["Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9x5 inch loaf pan.", "In a large bowl, combine flour, baking soda and salt. In a separate bowl, cream together butter and brown sugar. Stir in eggs and mashed bananas until well blended. Stir banana mixture into flour mixture; stir just to moisten. Pour batter into prepared loaf pan.", "Bake in preheated oven for 60 to 65 minutes, until a toothpick inserted into center of the loaf comes out clean. Let bread cool in pan for 10 minutes, then turn out onto a wire rack."], "prepTime": "PT15M", "name": "Banana Banana Bread"}
{"totalTime": "PT40M", "description": "\"These muffins are extra large and yummy with the sugary-cinnamon crumb topping. I usually double the recipe and fill the muffin cups just to the top edge for a wonderful extra-generously-sized deli style muffin.  Add extra blueberries too, if you want!\"", "ingredients": ["1 1/2 cups all-purpose flour", "3/4 cup white sugar", "1/2 teaspoon salt", "2 teaspoons baking powder", "1/3 cup vegetable oil", "1 egg", "1/3 cup milk", "1 cup fresh blueberries", "1/2 cup white sugar", "1/3 cup all-purpose flour", "1/4 cup butter, cubed", "1 1/2 teaspoons ground cinnamon"], "url": "http://allrecipes.com/recipe/6865/to-die-for-blueberry-muffins/", "image": null, "cookTime": "PT25M", "recipeYield": "8", "recipeInstructions": ["Preheat oven to 400 degrees F (200 degrees C). Grease muffin cups or line with muffin liners.", "Combine 1 1/2 cups flour, 3/4 cup sugar, salt and baking powder. Place vegetable oil into a 1 cup measuring cup; add the egg and enough milk to fill the cup. Mix this with flour mixture. Fold in blueberries. Fill muffin cups right to the top, and sprinkle with crumb topping mixture.", "To Make Crumb Topping: Mix together 1/2 cup sugar, 1/3 cup flour, 1/4 cup butter,  and 1 1/2 teaspoons cinnamon. Mix with fork, and sprinkle over muffins before baking.", "Bake for 20 to 25 minutes in the preheated oven, or until done."], "prepTime": "PT15M", "name": "To Die For Blueberry Muffins"}
{"totalTime": "PT15M", "description": "\"Flavorful recipe for this farm raised fish that is easy and done in minutes! The fish is broiled with a creamy cheese coating for an impressive flavor and texture.\"", "ingredients": ["1/2 cup Parmesan cheese", "1/4 cup butter, softened", "3 tablespoons mayonnaise", "2 tablespoons fresh lemon juice", "1/4 teaspoon dried basil", "1/4 teaspoon ground black pepper", "1/8 teaspoon onion powder", "1/8 teaspoon celery salt", "2 pounds tilapia fillets"], "url": "http://allrecipes.com/recipe/50644/broiled-tilapia-parmesan/", "image": null, "cookTime": "PT10M", "recipeYield": "8", "recipeInstructions": ["Preheat your oven's broiler. Grease a broiling pan or line pan with aluminum foil.", "In a small bowl, mix together the Parmesan cheese, butter, mayonnaise and lemon juice. Season with dried basil, pepper, onion powder and celery salt. Mix well and set aside.", "Arrange fillets in a single layer on the prepared pan. Broil a few inches from the heat for 2 to 3 minutes. Flip the fillets over and broil for a couple more minutes. Remove the fillets from the oven and cover them with the Parmesan cheese mixture on the top side. Broil for 2 more minutes or until the topping is browned and fish flakes easily with a fork. Be careful not to over cook the fish."], "prepTime": "PT5M", "name": "Broiled Tilapia Parmesan"}
{"totalTime": "PT1H10M", "description": "\"A delicious chicken pie made from scratch with carrots, peas and celery.\"", "ingredients": ["1 pound skinless, boneless chicken breast halves - cubed", "1 cup sliced carrots", "1 cup frozen green peas", "1/2 cup sliced celery", "1/3 cup butter", "1/3 cup chopped onion", "1/3 cup all-purpose flour", "1/2 teaspoon salt", "1/4 teaspoon black pepper", "1/4 teaspoon celery seed", "1 3/4 cups chicken broth", "2/3 cup milk", "2 (9 inch) unbaked pie crusts"], "url": "http://allrecipes.com/recipe/26317/chicken-pot-pie-ix/", "image": null, "cookTime": "PT50M", "recipeYield": "8", "recipeInstructions": ["Preheat oven to 425 degrees F (220 degrees C.)", "In a saucepan, combine chicken, carrots, peas, and celery. Add water to cover and boil for 15 minutes. Remove from heat, drain and set aside.", "In the saucepan over medium heat, cook onions in butter until soft and translucent. Stir in flour, salt, pepper, and celery seed. Slowly stir in chicken broth and milk. Simmer over medium-low heat until thick. Remove from heat and set aside.", "Place the chicken mixture in bottom pie crust. Pour hot liquid mixture over. Cover with top crust, seal edges, and cut away excess dough. Make several small slits in the top to allow steam to escape.", "Bake in the preheated oven for 30 to 35 minutes, or until pastry is golden brown and filling is bubbly. Cool for 10 minutes before serving."], "prepTime": "PT20M", "name": "Chicken Pot Pie IX"}
{"totalTime": "PT1H30M", "description": "\"This is an easy tasty meatloaf. It tastes as good as it smells!\"", "ingredients": ["1/2 cup packed brown sugar", "1/2 cup ketchup", "1 1/2 pounds lean ground beef", "3/4 cup milk", "2 eggs", "1 1/2 teaspoons salt", "1/4 teaspoon ground black pepper", "1 small onion, chopped", "1/4 teaspoon ground ginger", "3/4 cup finely crushed saltine cracker crumbs"], "url": "http://allrecipes.com/recipe/25203/brown-sugar-meatloaf/", "image": null, "cookTime": "PT1H", "recipeYield": "8", "recipeInstructions": ["Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 5x9 inch loaf pan.", "Press the brown sugar in the bottom of the prepared loaf pan and spread the ketchup over the sugar.", "In a mixing bowl, mix thoroughly all remaining ingredients and shape into a loaf. Place on top of the ketchup.", "Bake in preheated oven for 1 hour or until juices are clear."], "prepTime": "PT20M", "name": "Brown Sugar Meatloaf"}
{"totalTime": "PT1H5M", "description": "\"Chicken Makhani is a dish I always loved before becoming vegan. It is my absolute favorite Indian dish, so I knew I had to try to make it so I could curb my cravings. The sauce tastes amazing with naan and white rice. The seitan is an excellent substitute for meat in many dishes. You can buy store-bought seitan, which can be expensive, or you can make your own.\"", "ingredients": ["1 tablespoon peanut oil", "1 shallot, finely chopped", "1/4 cup onion, chopped", "2 tablespoons vegan margarine", "2 teaspoons lemon juice", "1 teaspoon ground ginger", "2 cloves garlic, minced", "2 teaspoons garam masala", "2 teaspoons curry powder", "1 teaspoon chili powder", "2 teaspoons ground cumin", "1 bay leaf", "1 cup tomato puree", "1 cup soy milk", "1/4 cup plain vegan yogurt", "1/4 teaspoon cayenne pepper, or to taste", "1 pinch salt and black pepper to taste", "1 1/2 teaspoons peanut oil", "1 (16 ounce) package chicken-style seitan, cut into strips or cubes", "2 teaspoons garam masala", "1 pinch cayenne pepper", "1 tablespoon cornstarch", "1/4 cup cold water"], "url": "http://allrecipes.com/recipe/213236/seitan-makhani-vegan-style-indian-butter-chicken/", "image": "http://images.media-allrecipes.com/userphotos/250x250/770921.jpg", "cookTime": "PT35M", "recipeYield": "6", "recipeInstructions": ["Heat 1 tablespoon peanut oil in a saucepan over medium heat. Stir in the shallot and onion; cook and stir until the onion has softened and turned translucent, about 5 minutes. Add the margarine, lemon juice, ginger, garlic, garam masala, curry powder, chili powder, cumin, and bay leaf. Cook and stir for 1 minute. Stir in the tomato puree and cook for 2 minutes more.", "Reduce the heat to low, and mix in the soy milk and soy yogurt. Simmer for 10 minutes, stirring frequently. Season to taste with cayenne, salt, and black pepper; remove from heat and set aside.", "Heat 1 1/2 teaspoons of peanut oil in a heavy skillet (preferably cast iron) over medium heat. Add the seitan and cook, stirring constantly, for 10 minutes. Reduce the heat to low and season the seitan with 2 teaspoons garam masala and a pinch of cayenne. Stir in about a 1/4 cup of the tomato-yogurt sauce and simmer for 2 to 3 minutes. Transfer the seitan mixture to the saucepan.", "Mix the cornstarch and cold water. Return the saucepan to the stove over medium-high heat. Stir the cornstarch mixture into the sauce. Bring to a boil; reduce the heat and simmer until the sauce has thickened, about 5 to 10 minutes."], "prepTime": "PT30M", "name": "Seitan Makhani (Vegan-Style Indian Butter Chicken)"}
{"totalTime": "PT3H", "description": "\"Whenever you make these cookies for someone, be sure to bring along several copies of the recipe!  You will be asked for it, I promise! NOTE: I make icing with confectioners' sugar and milk. I make it fairly thin, as I 'paint' the icing on the cookies with a pastry brush. Thin enough to spread easily but not so thin that it just makes your cookies wet and runs off.\"", "ingredients": ["1 1/2 cups butter, softened", "2 cups white sugar", "4 eggs", "1 teaspoon vanilla extract", "5 cups all-purpose flour", "2 teaspoons baking powder", "1 teaspoon salt"], "url": "http://allrecipes.com/recipe/10402/the-best-rolled-sugar-cookies/", "image": null, "cookTime": "PT8M", "recipeYield": "60", "recipeInstructions": ["In a large bowl, cream together butter and sugar until smooth. Beat in eggs and vanilla. Stir in the  flour, baking powder, and salt. Cover, and chill dough for at least one hour (or overnight).", "Preheat oven to 400 degrees F (200 degrees C). Roll out dough on floured surface 1/4 to 1/2 inch thick. Cut into shapes with any cookie cutter. Place cookies 1 inch apart on ungreased cookie sheets.", "Bake 6 to 8 minutes in preheated oven. Cool completely."], "prepTime": "PT20M", "name": "The Best Rolled Sugar Cookies"}
{"totalTime": "PT40M", "description": "\"These cookies are the pinnacle of perfection! If you want a big, fat, chewy cookie like the kind you see at bakeries and specialty shops, then these are the cookies for you!\"", "ingredients": ["2 cups all-purpose flour", "1/2 teaspoon baking soda", "1/2 teaspoon salt", "3/4 cup unsalted butter, melted", "1 cup packed brown sugar", "1/2 cup white sugar", "1 tablespoon vanilla extract", "1 egg", "1 egg yolk", "2 cups semisweet chocolate chips"], "url": "http://allrecipes.com/recipe/25037/best-big-fat-chewy-chocolate-chip-cookie/", "image": null, "cookTime": "PT15M", "recipeYield": "18", "recipeInstructions": ["Preheat the oven to 325 degrees F (165 degrees C). Grease cookie sheets or line with parchment paper.", "Sift together the flour, baking soda and salt; set aside.", "In a medium bowl, cream together the melted butter, brown sugar and white sugar until well blended. Beat in the vanilla, egg, and egg yolk until light and creamy. Mix in the sifted ingredients until just blended. Stir in the chocolate chips by hand using a wooden spoon. Drop cookie dough 1/4 cup at a time onto the prepared cookie sheets. Cookies should be about 3 inches apart.", "Bake for 15 to 17 minutes in the preheated oven, or until the edges are lightly toasted. Cool on baking sheets for a few minutes before transferring to wire racks to cool completely."], "prepTime": "PT10M", "name": "Best Big, Fat, Chewy Chocolate Chip Cookie"}
{"totalTime": "PT25M", "description": "\"Chicken French has everything I love in a recipe. It's delicious and easy, frugal, yet fancy, and everyone loves it. Better yet, it has a vague, confusing history and completely preposterous name. This not-French recipe hails from the Rochester area of New York State, where it's a staple on virtually every Italian-American restaurant menu.\"", "ingredients": ["4 eggs", "2 tablespoons milk", "1 cup all-purpose flour", "1 tablespoon salt", "1 teaspoon ground black pepper", "1 pinch cayenne pepper", "1 1/2 pounds skinless, boneless chicken breast cutlets, pounded flat", "2 tablespoons olive oil", "1 tablespoon butter", "1 cup vegetable broth", "1/2 cup dry sherry", "2 lemons, juiced", "1/4 cup cold butter, cut into chunks", "1 tablespoon chopped fresh flat-leaf parsley", "salt and ground black pepper to taste"], "url": "http://allrecipes.com/recipe/237499/chef-johns-chicken-french/", "image": null, "cookTime": "PT10M", "recipeYield": "4", "recipeInstructions": ["Beat eggs and milk together in a shallow bowl. Whisk flour, salt, black pepper, and cayenne pepper together in another shallow bowl.", "Gently press chicken into flour mixture to coat; shake off excess flour. Dip into egg mixture and coat completely.", "Heat olive oil and 1 tablespoon butter together in a large skillet over medium heat. Cook chicken in hot oil until lightly browned, 2 to 3 minutes per side. Transfer chicken to a plate.", "Cook and stir vegetable broth, sherry, and lemon juice in the same skillet; bring to a boil and cook until sauce is reduced by half. Remove from heat and add cold butter chunks; stir until butter is melted and sauce is shiny and thickened, 1 to 2 minutes. Stir parsley into sauce and season with salt and pepper.", "Return chicken to the skillet over medium heat, spoon sauce over the top, and cook until chicken is heated through and no longer pink in the center, 1 to 3 minutes more."], "prepTime": "PT15M", "name": "Chef John's Chicken French"}
{"totalTime": "PT1H30M", "description": "\"This was my grandmother's apple pie recipe.  I have never seen another one quite like it.  It will always be my favorite and has won me several first place prizes in local competitions.  I hope it becomes one of your favorites as well!\"", "ingredients": ["1 recipe pastry for a 9 inch double crust pie", "1/2 cup unsalted butter", "3 tablespoons all-purpose flour", "1/4 cup water", "1/2 cup white sugar", "1/2 cup packed brown sugar", "8 Granny Smith apples - peeled, cored and sliced"], "url": "http://allrecipes.com/recipe/12682/apple-pie-by-grandma-ople/", "image": null, "cookTime": "PT1H", "recipeYield": "8", "recipeInstructions": ["Preheat oven to 425 degrees F (220 degrees C). Melt the butter in a saucepan. Stir in flour to form a paste. Add water, white sugar and brown sugar, and bring to a boil. Reduce temperature and let simmer.", "Place the bottom crust in your pan. Fill with apples, mounded slightly. Cover with a lattice work crust.  Gently pour the sugar and butter liquid over the crust.  Pour slowly so that it does not run off.", "Bake 15 minutes in the preheated oven. Reduce the temperature to 350 degrees F (175 degrees C). Continue baking for 35 to 45 minutes, until apples are soft."], "prepTime": "PT30M", "name": "Apple Pie by Grandma Ople"}
{"totalTime": "PT1H40M", "description": "\"Really, really good and moist- my kids eat it as quickly as I can make it.  Bread will freeze well, and keep in refrigerator for weeks.\"", "ingredients": ["3 cups all-purpose flour", "1 teaspoon salt", "1 teaspoon baking soda", "1 teaspoon baking powder", "3 teaspoons ground cinnamon", "3 eggs", "1 cup vegetable oil", "2 1/4 cups white sugar", "3 teaspoons vanilla extract", "2 cups grated zucchini", "1 cup chopped walnuts"], "url": "http://allrecipes.com/recipe/6698/moms-zucchini-bread/", "image": null, "cookTime": "PT1H", "recipeYield": "24", "recipeInstructions": ["Grease and flour two 8 x 4 inch pans.  Preheat oven to 325 degrees F (165 degrees C).", "Sift flour, salt, baking powder, soda, and cinnamon together in a bowl.", "Beat eggs, oil, vanilla, and sugar together in a large bowl.  Add sifted ingredients to the creamed mixture, and beat well.  Stir in zucchini and nuts until well combined.  Pour batter into prepared pans.", "Bake for 40 to 60 minutes, or until tester inserted in the center comes out clean.  Cool in pan on rack for 20 minutes.  Remove bread from pan, and completely cool."], "prepTime": "PT20M", "name": "Mom's Zucchini Bread"}
{"totalTime": "PT2H5M", "description": "\"I have enjoyed this recipe for many years. It's very simple and full of flavor.\"", "ingredients": ["2 tablespoons vegetable oil", "4 (1/2 inch thick) pork chops", "1 cup white rice", "1 large tomato, thinly sliced", "1 green bell pepper, cut into thin strips", "1 onion, cut into rings", "1/2 teaspoon dried marjoram", "1/2 teaspoon dried thyme", "salt and pepper to taste", "2 (10.5 ounce) cans beef consomme"], "url": "http://allrecipes.com/recipe/230888/kents-pork-chop-casserole/", "image": "http://images.media-allrecipes.com/userphotos/720x405/994042.jpg", "cookTime": "PT1H45M", "recipeYield": "4", "recipeInstructions": ["Preheat oven to 350 degrees F (175 degrees C). Grease a 2-quart baking dish.", "Heat vegetable oil in a large skillet over medium-high heat. Sear pork chops until browned on each side, about 3 minutes per side.", "Pour rice into prepared baking dish. Layer half the tomato slices, bell pepper strips, and onion slices onto rice. Top with 2 pork chops. Add remaining tomatoes, peppers, and onions in layers; top with remaining 2 chops. Sprinkle with marjoram, thyme, salt, and black pepper to taste. Pour consomme into the baking dish; cover.", "Bake in preheated oven until rice and vegetables are tender and pork is cooked through, about 1 hour and 45 minutes."], "prepTime": "PT20M", "name": "Kent's Pork Chop Casserole"}
{"totalTime": "PT6H10M", "description": "\"This is an easy slow cooker recipe that cooks while you are at work! It is wonderful on a cold, snowy day. I have four children who are picky eaters, and they LOVE this! Enjoy!\"", "ingredients": ["4 skinless, boneless chicken breast halves", "2 tablespoons butter", "2 (10.75 ounce) cans condensed cream of chicken soup", "1 onion, finely diced", "2 (10 ounce) packages refrigerated biscuit dough, torn into pieces"], "url": "http://allrecipes.com/recipe/8941/slow-cooker-chicken-and-dumplings/", "image": null, "cookTime": "PT6H", "recipeYield": "8", "recipeInstructions": ["Place the chicken, butter, soup, and onion in a slow cooker, and fill with enough water to cover.", "Cover, and cook for 5 to 6 hours on High. About 30 minutes before serving, place the torn biscuit dough in the slow cooker. Cook until the dough is no longer raw in the center."], "prepTime": "PT10M", "name": "Slow Cooker Chicken and Dumplings"}
{"totalTime": "PT3H15M", "description": "\"It takes a little work, but it is worth it.\"", "ingredients": ["1 pound sweet Italian sausage", "3/4 pound lean ground beef", "1/2 cup minced onion", "2 cloves garlic, crushed", "1 (28 ounce) can crushed tomatoes", "2 (6 ounce) cans tomato paste", "2 (6.5 ounce) cans canned tomato sauce", "1/2 cup water", "2 tablespoons white sugar", "1 1/2 teaspoons dried basil leaves", "1/2 teaspoon fennel seeds", "1 teaspoon Italian seasoning", "1 tablespoon salt", "1/4 teaspoon ground black pepper", "4 tablespoons chopped fresh parsley", "12 lasagna noodles", "16 ounces ricotta cheese", "1 egg", "1/2 teaspoon salt", "3/4 pound mozzarella cheese, sliced", "3/4 cup grated Parmesan cheese"], "url": "http://allrecipes.com/recipe/23600/worlds-best-lasagna/", "image": null, "cookTime": "PT2H30M", "recipeYield": "12", "recipeInstructions": ["In a Dutch oven, cook sausage, ground beef, onion, and garlic over medium heat until well browned. Stir in crushed tomatoes, tomato paste, tomato sauce, and water. Season with sugar, basil, fennel seeds, Italian seasoning, 1 tablespoon salt, pepper, and 2 tablespoons parsley. Simmer, covered, for about 1 1/2 hours, stirring occasionally.", "Bring a large pot of lightly salted water to a boil. Cook lasagna noodles in boiling water for 8 to 10 minutes. Drain noodles, and rinse with cold water.  In a mixing bowl, combine ricotta cheese with egg, remaining parsley, and 1/2 teaspoon salt.", "Preheat oven to 375  degrees F (190 degrees C).", "To assemble, spread 1 1/2 cups of meat sauce in the bottom of a 9x13 inch baking dish.  Arrange 6 noodles lengthwise over meat sauce. Spread with one half of the ricotta cheese mixture. Top with a third of mozzarella cheese slices. Spoon 1 1/2 cups meat sauce over mozzarella, and sprinkle with 1/4 cup Parmesan cheese.  Repeat layers, and top with remaining mozzarella and Parmesan cheese. Cover with foil: to prevent sticking, either spray foil with cooking spray, or make sure the foil does not touch the cheese.", "Bake in preheated oven for 25 minutes. Remove foil, and bake an additional 25 minutes. Cool for 15 minutes before serving."], "prepTime": "PT30M", "name": "World's Best Lasagna"}
{"totalTime": "PT6H30M", "description": "\"This is one of my favorite soups and it always gets rave reviews! Salad, hard rolls and wine make a meal! You can make this 24 hours ahead of time without the noodles and wait to add the spinach noodles until soup is reheated for serving. Yummy! Serve topped with grated Parmesan!\"", "ingredients": ["1 1/2 pounds sweet Italian sausage", "2 cloves garlic, minced", "2 small onions, chopped", "2 (16 ounce) cans whole peeled tomatoes", "1 1/4 cups dry red wine", "5 cups beef broth", "1/2 teaspoon dried basil", "1/2 teaspoon dried oregano", "2 zucchini, sliced", "1 green bell pepper, chopped", "3 tablespoons chopped fresh parsley", "1 (16 ounce) package spinach fettuccine pasta", "salt and pepper to taste"], "url": "http://allrecipes.com/recipe/25713/best-italian-sausage-soup/", "image": null, "cookTime": "PT6H", "recipeYield": "8", "recipeInstructions": ["In a large pot, cook sausage over medium heat until brown. Remove with a slotted spoon, and drain on paper towels. Drain fat from pan, reserving 3 tablespoons.", "Cook garlic and onion in reserved fat for 2 to 3 minutes. Stir in tomatoes, wine, broth, basil, and oregano. Transfer to a slow cooker, and stir in sausage, zucchini, bell pepper, and parsley.", "Cover, and cook on Low for 4 to 6 hours.", "Bring a pot of lightly salted water to a boil. Cook pasta in boiling water until al dente, about 7 minutes. Drain water, and add pasta to the slow cooker. Simmer for a few minutes, and season with salt and pepper before serving."], "prepTime": "PT30M", "name": "Best Italian Sausage Soup"}
{"totalTime": "PT1H5M", "description": "\"This is a great old Maine recipe, moist and spicy. The bread actually tastes even better the day after it is baked. Great for holiday gift giving!\"", "ingredients": ["1 (15 ounce) can pumpkin puree", "4 eggs", "1 cup vegetable oil", "2/3 cup water", "3 cups white sugar", "3 1/2 cups all-purpose flour", "2 teaspoons baking soda", "1 1/2 teaspoons salt", "1 teaspoon ground cinnamon", "1 teaspoon ground nutmeg", "1/2 teaspoon ground cloves", "1/4 teaspoon ground ginger"], "url": "http://allrecipes.com/recipe/6820/downeast-maine-pumpkin-bread/", "image": null, "cookTime": "PT50M", "recipeYield": "24", "recipeInstructions": ["Preheat oven to 350 degrees F (175 degrees C). Grease and flour three 7x3 inch loaf pans.", "In a large bowl, mix together pumpkin puree, eggs, oil, water and sugar until well blended. In a separate bowl, whisk together the flour, baking soda, salt, cinnamon, nutmeg, cloves and ginger. Stir the dry ingredients into the pumpkin mixture until just blended. Pour into the prepared pans.", "Bake for about 50 minutes in the preheated oven. Loaves are done when toothpick inserted in center comes out clean."], "prepTime": "PT15M", "name": "Downeast Maine Pumpkin Bread"}
{"totalTime": "PT1H5M", "description": "\"This is a delicious recipe. I have been enjoying this for a long time.\"", "ingredients": ["8 chicken thighs", "4 tomatoes, quartered", "8 cloves garlic, minced", "4 teaspoons minced fresh ginger root", "1 teaspoon chili powder", "1 pinch ground turmeric", "1 teaspoon salt", "1/2 teaspoon coconut oil (optional)"], "url": "http://allrecipes.com/recipe/192533/tomato-chicken/", "image": "http://images.media-allrecipes.com/userphotos/720x405/1010701.jpg", "cookTime": "PT50M", "recipeYield": "4", "recipeInstructions": ["Combine the chicken, tomatoes, garlic, ginger, chili powder, turmeric, and salt in a large, heavy pot over high heat; cook and stir until the chicken begins to brown; reduce heat to medium-low and allow mixture to simmer until the chicken is no longer pink in the center and the juices run clear, about 45 minutes. Sprinkle with coconut oil to serve."], "prepTime": "PT15M", "name": "Tomato Chicken"}
{"totalTime": "PT8H10M", "description": "\"This is a very easy recipe for a delicious pot roast. It makes its own gravy. It's designed especially for the working person who does not have time to cook all day, but it tastes like you did.  You'll want the cut to be between 5 and 6 pounds.\"", "ingredients": ["2 (10.75 ounce) cans condensed cream of mushroom soup", "1 (1 ounce) package dry onion soup mix", "1 1/4 cups water", "5 1/2 pounds pot roast"], "url": "http://allrecipes.com/recipe/16066/awesome-slow-cooker-pot-roast/", "image": null, "cookTime": "PT8H", "recipeYield": "12", "recipeInstructions": ["In a slow cooker, mix cream of mushroom soup, dry onion soup mix and water. Place pot roast in slow cooker and coat with soup mixture.", "Cook on High setting for 3 to 4 hours, or on Low setting for 8 to 9 hours."], "prepTime": "PT10M", "name": "Awesome Slow Cooker Pot Roast"}
{"totalTime": "PT25M", "description": "\"Tall and fluffy.  These pancakes are just right.  Topped with strawberries and whipped cream, they are impossible to resist.\"", "ingredients": ["3/4 cup milk", "2 tablespoons white vinegar", "1 cup all-purpose flour", "2 tablespoons white sugar", "1 teaspoon baking powder", "1/2 teaspoon baking soda", "1/2 teaspoon salt", "1 egg", "2 tablespoons butter, melted", "cooking spray"], "url": "http://allrecipes.com/recipe/162760/fluffy-pancakes/", "image": null, "cookTime": "PT10M", "recipeYield": "4", "recipeInstructions": ["Combine milk with vinegar in a medium bowl and set aside for 5 minutes to \"sour\".", "Combine flour, sugar, baking powder, baking soda, and salt in a large mixing bowl. Whisk egg and butter into \"soured\" milk. Pour the flour mixture into the wet ingredients and whisk until lumps are gone.", "Heat a large skillet over medium heat, and coat with cooking spray. Pour 1/4 cupfuls of batter onto the skillet, and cook until bubbles appear on the surface. Flip with a spatula, and cook until browned on the other side."], "prepTime": "PT10M", "name": "Fluffy Pancakes"}
{"totalTime": "PT25M", "description": "\"Tall and fluffy.  These pancakes are just right.  Topped with strawberries and whipped cream, they are impossible to resist.\"", "ingredients": ["3/4 cup milk", "2 tablespoons white vinegar", "1 cup all-purpose flour", "2 tablespoons white sugar", "1 teaspoon baking powder", "1/2 teaspoon baking soda", "1/2 teaspoon salt", "1 egg", "2 tablespoons butter, melted", "cooking spray"], "url": "http://allrecipes.com/recipe/162760/fluffy-pancakes-2/", "image": null, "cookTime": "PT10M", "recipeYield": "4", "recipeInstructions": ["Combine milk with vinegar in a medium bowl and set aside for 5 minutes to \"sour\".", "Combine flour, sugar, baking powder, baking soda, and salt in a large mixing bowl. Whisk egg and butter into \"soured\" milk. Pour the flour mixture into the wet ingredients and whisk until lumps are gone.", "Heat a large skillet over medium heat, and coat with cooking spray. Pour 1/4 cupfuls of batter onto the skillet, and cook until bubbles appear on the surface. Flip with a spatula, and cook until browned on the other side."], "prepTime": "PT10M", "name": "Fluffy Pancakes"}
{"totalTime": "PT7H15M", "description": "\"You can call this soup or chili, but either way it is wonderful! This recipe is also very adaptable to your personal taste. I recommend using Bill Echols' Taco Seasoning from this website. Serve topped with shredded Cheddar cheese, a dollop of sour cream, and crushed tortilla chips, if you like. I hope you enjoy!\"", "ingredients": ["1 onion, chopped", "1 (16 ounce) can chili beans", "1 (15 ounce) can black beans", "1 (15 ounce) can whole kernel corn, drained", "1 (8 ounce) can tomato sauce", "1 (12 fluid ounce) can or bottle beer", "2 (10 ounce) cans diced tomatoes with green chilies, undrained", "1 (1.25 ounce) package taco seasoning", "3 whole skinless, boneless chicken breasts", "1 (8 ounce) package shredded Cheddar cheese (optional)", "sour cream (optional)", "crushed tortilla chips (optional)"], "url": "http://allrecipes.com/recipe/70343/slow-cooker-chicken-taco-soup/", "image": null, "cookTime": "PT7H", "recipeYield": "8", "recipeInstructions": ["Place the onion, chili beans, black beans, corn, tomato sauce, beer, and diced tomatoes in a slow cooker. Add taco seasoning, and stir to blend. Lay chicken breasts on top of the mixture, pressing down slightly until just covered by the other ingredients. Set slow cooker for low heat, cover, and cook for 5 hours.", "Remove chicken breasts from the soup, and allow to cool long enough to be handled. Stir the shredded chicken back into the soup, and continue cooking for 2 hours. Serve topped with shredded Cheddar cheese, a dollop of sour cream, and crushed tortilla chips, if desired."], "prepTime": "PT15M", "name": "Slow Cooker Chicken Taco Soup"}
{"totalTime": "PT1M", "description": "\"Depending on how spicy you and your family like your dishes, use as little or as much as you want.\"", "ingredients": ["1 tablespoon chili powder", "1/4 teaspoon garlic powder", "1/4 teaspoon onion powder", "1/4 teaspoon crushed red pepper flakes", "1/4 teaspoon dried oregano", "1/2 teaspoon paprika", "1 1/2 teaspoons ground cumin", "1 teaspoon sea salt", "1 teaspoon black pepper"], "url": "http://allrecipes.com/recipe/46653/taco-seasoning-i/", "image": null, "cookTime": "", "recipeYield": "10", "recipeInstructions": ["In a small bowl, mix together chili powder, garlic powder, onion powder, red pepper flakes, oregano, paprika, cumin, salt and pepper. Store in an airtight container."], "prepTime": "PT1M", "name": "Taco Seasoning I"}
{"totalTime": "PT2H", "description": "\"A pork chop recipe that is quick and easy. You may have all the ingredients already in the house. Try serving over rice.\"", "ingredients": ["6 pork chops", "1 teaspoon garlic powder", "1 teaspoon seasoning salt", "2 egg, beaten", "1/4 cup all-purpose flour", "2 cups Italian-style seasoned bread crumbs", "4 tablespoons olive oil", "1 (10.75 ounce) can condensed cream of mushroom soup", "1/2 cup milk", "1/3 cup white wine"], "url": "http://allrecipes.com/recipe/16348/baked-pork-chops-i/", "image": null, "cookTime": "PT1H30M", "recipeYield": "6", "recipeInstructions": ["Preheat oven to 350 degrees F (175 degrees C).", "Rinse pork chops, pat dry, and season with garlic powder and seasoning salt to taste. Place the beaten eggs in a small bowl. Dredge the pork chops lightly in flour, dip in the egg, and coat liberally with bread crumbs.", "Heat the oil in a medium skillet over medium-high heat. Fry the pork chops 5 minutes per side, or until the breading appears well browned. Transfer the chops to a 9x13 inch baking dish, and cover with foil.", "Bake in the preheated oven for 1 hour. While baking, combine the cream of mushroom soup, milk and white wine in a medium bowl. After the pork chops have baked for an hour, cover them with the soup mixture. Replace foil, and bake for another 30 minutes."], "prepTime": "PT30M", "name": "Baked Pork Chops I"}
{"totalTime": "PT10M", "description": "\"You can make this avocado salad smooth or chunky depending on your tastes.\"", "ingredients": ["3 avocados - peeled, pitted, and mashed", "1 lime, juiced", "1 teaspoon salt", "1/2 cup diced onion", "3 tablespoons chopped fresh cilantro", "2 roma (plum) tomatoes, diced", "1 teaspoon minced garlic", "1 pinch ground cayenne pepper (optional)"], "url": "http://allrecipes.com/recipe/14231/guacamole/", "image": null, "cookTime": "", "recipeYield": "4", "recipeInstructions": ["In a medium bowl, mash together the avocados, lime juice, and salt. Mix in onion, cilantro, tomatoes, and garlic. Stir in cayenne pepper. Refrigerate 1 hour for best flavor, or serve immediately."], "prepTime": "PT10M", "name": "Guacamole"}
{"totalTime": "PT1H30M", "description": "\"A much requested chicken recipe! Easy to double for a large group. Delicious!\"", "ingredients": ["1 tablespoon cornstarch", "1 tablespoon cold water", "1/2 cup white sugar", "1/2 cup soy sauce", "1/4 cup cider vinegar", "1 clove garlic, minced", "1/2 teaspoon ground ginger", "1/4 teaspoon ground black pepper", "12 skinless chicken thighs"], "url": "http://allrecipes.com/recipe/9023/baked-teriyaki-chicken/", "image": null, "cookTime": "PT1H", "recipeYield": "6", "recipeInstructions": ["In a small saucepan over low heat, combine the cornstarch, cold water, sugar, soy sauce, vinegar, garlic, ginger and ground black pepper. Let simmer, stirring frequently, until sauce thickens and bubbles.", "Preheat oven to 425 degrees F (220 degrees C).", "Place chicken pieces in a lightly greased 9x13 inch baking dish. Brush chicken with the sauce. Turn pieces over, and brush again.", "Bake in the preheated oven for 30 minutes. Turn pieces over, and bake for another 30 minutes, until no longer pink and juices run clear. Brush with sauce every 10 minutes during cooking."], "prepTime": "PT30M", "name": "Baked Teriyaki Chicken"}
{"totalTime": "PT50M", "description": "\"These are just what they say: big, soft, gingerbread cookies. They stay soft, too. My oldest son's favorite.\"", "ingredients": ["2 1/4 cups all-purpose flour", "2 teaspoons ground ginger", "1 teaspoon baking soda", "3/4 teaspoon ground cinnamon", "1/2 teaspoon ground cloves", "1/4 teaspoon salt", "3/4 cup margarine, softened", "1 cup white sugar", "1 egg", "1 tablespoon water", "1/4 cup molasses", "2 tablespoons white sugar"], "url": "http://allrecipes.com/recipe/17165/big-soft-ginger-cookies/", "image": null, "cookTime": "PT10M", "recipeYield": "24", "recipeInstructions": ["Preheat oven to 350 degrees F (175 degrees C). Sift together the flour, ginger, baking soda, cinnamon, cloves, and salt. Set aside.", "In a large bowl, cream together the margarine and 1 cup sugar until light and fluffy. Beat in the egg, then stir in the water and molasses. Gradually stir the sifted ingredients into the molasses mixture. Shape dough into walnut sized balls, and roll them in the remaining 2 tablespoons of sugar. Place the cookies 2 inches apart onto an ungreased cookie sheet, and flatten slightly.", "Bake for 8 to 10 minutes in the preheated oven. Allow cookies to cool on baking sheet for 5 minutes before removing to a wire rack to cool completely. Store in an airtight container."], "prepTime": "PT15M", "name": "Big Soft Ginger Cookies"}
{"totalTime": "", "description": "\"This cake won me First Prize at the county fair last year. It is very chocolaty.\"", "ingredients": ["1 (18.25 ounce) package devil's food cake mix", "1 (5.9 ounce) package instant chocolate pudding mix", "1 cup sour cream", "1 cup vegetable oil", "4 eggs", "1/2 cup warm water", "2 cups semisweet chocolate chips"], "url": "http://allrecipes.com/recipe/7565/too-much-chocolate-cake/", "image": null, "cookTime": "", "recipeYield": "12", "recipeInstructions": ["Preheat oven to 350 degrees F (175 degrees C).", "In a large bowl, mix together the cake and pudding mixes, sour cream, oil, beaten eggs and water.  Stir in the chocolate chips and pour batter into a well greased 12 cup bundt pan.", "Bake for 50 to 55 minutes, or until top is springy to the touch and a wooden toothpick inserted comes out clean. Cool cake thoroughly in pan at least an hour and a half before inverting onto a plate  If desired, dust the cake with powdered sugar."], "prepTime": "", "name": "Too Much Chocolate Cake"}
{"totalTime": "PT7H30M", "description": "\"This cake is easy to make, and it's so delicious. Everyone that's tried it has said it tasted just like the ones in a deli! You'll love it!\"", "ingredients": ["15 graham crackers, crushed", "2 tablespoons butter, melted", "4 (8 ounce) packages cream cheese", "1 1/2 cups white sugar", "3/4 cup milk", "4 eggs", "1 cup sour cream", "1 tablespoon vanilla extract", "1/4 cup all-purpose flour"], "url": "http://allrecipes.com/recipe/8350/chantals-new-york-cheesecake/", "image": null, "cookTime": "PT1H", "recipeYield": "12", "recipeInstructions": ["Preheat oven to 350 degrees F (175 degrees C). Grease a 9 inch springform pan.", "In a medium bowl, mix graham cracker crumbs with melted butter. Press onto bottom of springform pan.", "In a large bowl, mix cream cheese with sugar until smooth. Blend in milk, and then mix in the eggs one at a time, mixing just enough to incorporate. Mix in sour cream, vanilla and flour until smooth. Pour filling into prepared crust.", "Bake in preheated oven for 1 hour. Turn the oven off, and let cake cool in oven with the door closed for 5 to 6 hours; this prevents cracking. Chill in refrigerator until serving."], "prepTime": "PT30M", "name": "Chantal's New York Cheesecake"}
{"totalTime": "PT2H", "description": "\"I've tried many carrot cakes, and this is my favorite recipe. If you don't like pecans, feel free to leave them out.\"", "ingredients": ["4 eggs", "1 1/4 cups vegetable oil", "2 cups white sugar", "2 teaspoons vanilla extract", "2 cups all-purpose flour", "2 teaspoons baking soda", "2 teaspoons baking powder", "1/2 teaspoon salt", "2 teaspoons ground cinnamon", "3 cups grated carrots", "1 cup chopped pecans", "1/2 cup butter, softened", "8 ounces cream cheese, softened", "4 cups confectioners' sugar", "1 teaspoon vanilla extract", "1 cup chopped pecans"], "url": "http://allrecipes.com/recipe/7402/carrot-cake-iii/", "image": null, "cookTime": "PT1H", "recipeYield": "18", "recipeInstructions": ["Preheat oven to 350 degrees F (175 degrees C).  Grease and flour a 9x13 inch pan.", "In a large bowl, beat together eggs, oil, white sugar and 2 teaspoons vanilla. Mix in flour, baking soda, baking powder, salt and cinnamon. Stir in carrots. Fold in pecans.  Pour into prepared pan.", "Bake in the preheated oven for 40 to 50 minutes, or until a toothpick inserted into the center of the cake comes out clean. Let cool in pan for 10 minutes, then turn out onto a wire rack and cool completely.", "To Make Frosting:  In a medium bowl, combine butter, cream cheese, confectioners' sugar and 1 teaspoon vanilla. Beat until the mixture is smooth and creamy. Stir in chopped pecans. Frost the cooled cake."], "prepTime": "PT30M", "name": "Carrot Cake III"}
{"totalTime": "PT40M", "description": "\"Wonderful roasted cauliflower, my 11 year old son loves this! Add more spices and herbs to suit your taste.\"", "ingredients": ["2 tablespoons minced garlic", "3 tablespoons olive oil", "1 large head cauliflower, separated into florets", "1/3 cup grated Parmesan cheese", "salt and black pepper to taste", "1 tablespoon chopped fresh parsley"], "url": "http://allrecipes.com/recipe/54675/roasted-garlic-cauliflower/", "image": null, "cookTime": "PT25M", "recipeYield": "6", "recipeInstructions": ["Preheat the oven to 450 degrees F (220 degrees C). Grease a large casserole dish.", "Place the olive oil and garlic in a large resealable bag. Add cauliflower, and shake to mix. Pour into the prepared casserole dish, and season with salt and pepper to taste.", "Bake for 25 minutes, stirring halfway through. Top with Parmesan cheese and parsley, and broil for 3 to 5 minutes, until golden brown."], "prepTime": "PT15M", "name": "Roasted Garlic Cauliflower"}
{"totalTime": "PT1H", "description": "\"These brownies always turn out!\"", "ingredients": ["1/2 cup butter", "1 cup white sugar", "2 eggs", "1 teaspoon vanilla extract", "1/3 cup unsweetened cocoa powder", "1/2 cup all-purpose flour", "1/4 teaspoon salt", "1/4 teaspoon baking powder", "Frosting:", "3 tablespoons butter, softened", "3 tablespoons unsweetened cocoa powder", "1 tablespoon honey", "1 teaspoon vanilla extract", "1 cup confectioners' sugar"], "url": "http://allrecipes.com/recipe/10549/best-brownies/", "image": null, "cookTime": "PT35M", "recipeYield": "16", "recipeInstructions": ["Preheat oven to 350 degrees F (175 degrees C). Grease and flour an 8-inch square pan.", "In a large saucepan, melt 1/2 cup butter. Remove from heat, and stir in sugar, eggs, and 1 teaspoon vanilla. Beat in 1/3 cup cocoa, 1/2 cup flour, salt, and baking powder. Spread batter into prepared pan.", "Bake in preheated oven for 25 to 30 minutes. Do not overcook.", "To Make Frosting:  Combine 3 tablespoons softened butter, 3 tablespoons cocoa, honey, 1 teaspoon vanilla extract, and 1 cup confectioners' sugar. Stir until smooth. Frost brownies while they are still warm."], "prepTime": "PT25M", "name": "Best Brownies"}
{"totalTime": "PT1H", "description": "\"Crisp edges, chewy middles.\"", "ingredients": ["1 cup butter, softened", "1 cup white sugar", "1 cup packed brown sugar", "2 eggs", "2 teaspoons vanilla extract", "3 cups all-purpose flour", "1 teaspoon baking soda", "2 teaspoons hot water", "1/2 teaspoon salt", "2 cups semisweet chocolate chips", "1 cup chopped walnuts"], "url": "http://allrecipes.com/recipe/10813/best-chocolate-chip-cookies/", "image": null, "cookTime": "PT10M", "recipeYield": "24", "recipeInstructions": ["Preheat oven to 350 degrees F (175 degrees C).", "Cream together the butter, white sugar, and brown sugar until smooth. Beat in the eggs one at a time, then stir in the vanilla. Dissolve baking soda in hot water.  Add to batter along with salt. Stir in flour, chocolate chips, and nuts. Drop by large spoonfuls onto ungreased pans.", "Bake for about 10 minutes in the preheated oven, or until edges are nicely browned."], "prepTime": "PT20M", "name": "Best Chocolate Chip Cookies"}
{"totalTime": "", "description": "\"On busy crazy days, it is soooo nice to come home to this. Serve over rice.\"", "ingredients": ["1 1/2 pounds skinless, boneless chicken breast halves", "1/2 cup honey", "1/4 cup soy sauce", "2 tablespoons ketchup", "2 tablespoons dried minced onion", "1 tablespoon vegetable oil", "1/2 teaspoon garlic powder", "2 teaspoons cornstarch", "3 tablespoons water", "sesame seeds, or to taste"], "url": "http://allrecipes.com/recipe/241601/sesame-chicken-for-slow-cooker/", "image": "http://images.media-allrecipes.com/userphotos/720x405/2320248.jpg", "cookTime": "", "recipeYield": "4", "recipeInstructions": ["Spread chicken into the crock of a slow cooker.", "Stir honey, soy sauce, ketchup, minced onion, vegetable oil, and garlic powder together in a bowl; pour over the chicken.", "Cook on Low until the chicken is tender, 3 to 4 hours.", "Remove chicken from the sauce in the slow cooker to a cutting board. Stir water and cornstarch together to dissolve cornstarch completely; pour into the sauce in the slow cooker until smooth.", "Cook on High until slightly thickened, about 10 minutes.", "Cut chicken into bite-size pieces and stir into the sauce. Sprinkle sesame seeds over the chicken and sauce mixture."], "prepTime": "", "name": "Sesame Chicken for Slow Cooker"}
{"totalTime": "PT20M", "description": "\"This is a great recipe that I found in my Grandma's recipe book. Judging from the weathered look of this recipe card, this was a family favorite.\"", "ingredients": ["1 1/2 cups all-purpose flour", "3 1/2 teaspoons baking powder", "1 teaspoon salt", "1 tablespoon white sugar", "1 1/4 cups milk", "1 egg", "3 tablespoons butter, melted"], "url": "http://allrecipes.com/recipe/21014/good-old-fashioned-pancakes/", "image": null, "cookTime": "PT15M", "recipeYield": "8", "recipeInstructions": ["In a large bowl, sift together the flour, baking powder, salt and sugar. Make a well in the center and pour in the milk, egg and melted butter; mix until smooth.", "Heat a lightly oiled griddle or frying pan over medium high heat. Pour or scoop the batter onto the griddle, using approximately 1/4 cup for each pancake. Brown on both sides and serve hot."], "prepTime": "PT5M", "name": "Good Old Fashioned Pancakes"}
{"totalTime": "PT25M", "description": "\"A quick and easy way to prepare tilapia.\"", "ingredients": ["4 (6 ounce) tilapia fillets", "1 tablespoon olive oil", "1/2 cup chopped tomatoes", "5 pitted Kalamata olives, chopped", "1 tablespoon chopped onion", "1 tablespoon capers", "salt and ground black pepper to taste"], "url": "http://allrecipes.com/recipe/245635/grilled-tilapia-with-tomato-olive-tapenade/", "image": "http://images.media-allrecipes.com/userphotos/720x405/3239570.jpg", "cookTime": "PT15M", "recipeYield": "4", "recipeInstructions": ["Preheat oven to 375 degrees F (190 degrees C).", "Place tilapia fillets on a baking sheet and brush with olive oil.", "Bake tilapia in the preheated oven until opaque and easily flaked with a fork, 10 to 15 minutes.", "Combine chopped tomatoes, olives, onion, and capers in a small saucepan. Cook over medium-high heat, stirring occasionally, until tomatoes begin to break down and tapenade flavors are combined, 5 to 10 minutes. Spoon tapenade over baked fillets."], "prepTime": "PT10M", "name": "Grilled Tilapia with Tomato-Olive Tapenade"}
{"totalTime": "PT1H15M", "description": "\"These decadent brownies have a delicious layer of coconut sandwiched between two chocolate layers.  They were requested at a political campaign, at a social party and at my fiftieth anniversary.\"", "ingredients": ["1 cup butter, softened", "2 cups white sugar", "4 eggs", "1 1/2 teaspoons vanilla extract", "2 cups all-purpose flour", "3/4 teaspoon cream of tartar", "1/2 cup unsweetened cocoa powder", "1/2 cup chopped walnuts", "4 cups unsweetened flaked coconut", "1 (14 ounce) can sweetened condensed milk", "1 tablespoon vanilla extract"], "url": "http://allrecipes.com/recipe/25016/coconut-macaroon-brownies/", "image": "http://images.media-allrecipes.com/userphotos/720x405/3222206.jpg", "cookTime": "PT45M", "recipeYield": "18", "recipeInstructions": ["Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9x13 inch baking pan.", "In a large bowl, cream together the butter and sugar. Beat in the eggs, one at a time, then stir in 1 1/2 teaspoons vanilla. Combine the flour, cream of tartar and cocoa; stir into the egg mixture until well blended. Fold in walnuts. Spread half of this mixture into the bottom of the prepared pan.", "Make the middle layer. In a medium bowl, stir together the coconut, sweetened condensed milk and 1 tablespoon vanilla. Carefully layer this over the chocolate layer in the pan. Top with the remaining chocolate batter. Spread to cover evenly.", "Bake for 45 to 50 minutes in the preheated oven, until top is no longer shiny. Cool in the pan before cutting into bars."], "prepTime": "PT25M", "name": "Coconut Macaroon Brownies"}
{"totalTime": "PT55M", "description": "\"A lady I worked with brought this in one day, and it was a hit. Now it is the favorite of all my dinner guests. It's great for a covered dish dinner too. I have made this also without the meat, and it is well received.\"", "ingredients": ["1 pound dry ziti pasta", "1 onion, chopped", "1 pound lean ground beef", "2 (26 ounce) jars spaghetti sauce", "6 ounces provolone cheese, sliced", "1 1/2 cups sour cream", "6 ounces mozzarella cheese, shredded", "2 tablespoons grated Parmesan cheese"], "url": "http://allrecipes.com/recipe/11758/baked-ziti-i/", "image": null, "cookTime": "PT35M", "recipeYield": "10", "recipeInstructions": ["Bring a large pot of lightly salted water to a boil. Add ziti pasta, and cook until al dente, about 8 minutes; drain.", "In a large skillet, brown onion and ground beef over medium heat. Add spaghetti sauce, and simmer 15 minutes.", "Preheat the oven to 350 degrees F (175 degrees C). Butter a 9x13 inch baking dish. Layer as follows: 1/2 of the ziti, Provolone cheese, sour cream, 1/2 sauce mixture, remaining ziti, mozzarella cheese and remaining sauce mixture. Top with grated Parmesan cheese.", "Bake for 30 minutes in the preheated oven, or until cheeses are melted."], "prepTime": "PT20M", "name": "Baked Ziti I"}
{"totalTime": "PT40M", "description": "\"This is the recipe my mother used for sloppy joes and it always gets compliments!\"", "ingredients": ["1 pound lean ground beef", "1/4 cup chopped onion", "1/4 cup chopped green bell pepper", "1/2 teaspoon garlic powder", "1 teaspoon prepared yellow mustard", "3/4 cup ketchup", "3 teaspoons brown sugar", "salt to taste", "ground black pepper to taste"], "url": "http://allrecipes.com/recipe/24264/sloppy-joes-ii/", "image": null, "cookTime": "PT30M", "recipeYield": "6", "recipeInstructions": ["In a medium skillet over medium heat, brown the ground beef, onion, and green pepper; drain off liquids.", "Stir in the garlic powder, mustard, ketchup, and brown sugar; mix thoroughly. Reduce heat, and simmer for 30 minutes. Season with salt and pepper."], "prepTime": "PT10M", "name": "Sloppy Joes II"}
{"totalTime": "PT25M", "description": "\"Quick and easy sugar cookies! They are really good, plain or with candies in them. My friend uses chocolate mints on top, and they're great!\"", "ingredients": ["2 3/4 cups all-purpose flour", "1 teaspoon baking soda", "1/2 teaspoon baking powder", "1 cup butter, softened", "1 1/2 cups white sugar", "1 egg", "1 teaspoon vanilla extract"], "url": "http://allrecipes.com/recipe/9870/easy-sugar-cookies/", "image": null, "cookTime": "PT10M", "recipeYield": "48", "recipeInstructions": ["Preheat oven to 375 degrees F (190 degrees C). In a small bowl, stir together flour, baking soda, and baking powder. Set aside.", "In a large bowl, cream together the butter and sugar until smooth. Beat in egg and vanilla. Gradually blend in the dry ingredients. Roll rounded teaspoonfuls of dough into balls, and place onto ungreased cookie sheets.", "Bake 8 to 10 minutes in the preheated oven, or until golden. Let stand on cookie sheet two minutes before removing to cool on wire racks."], "prepTime": "PT15M", "name": "Easy Sugar Cookies"}
{"totalTime": "PT1H", "description": "\"These wonderful cinnamon-sugar cookies became very popular with my friends at church. My pastor loves them! You will too! Crispy edges, and chewy centers; these cookies are a crowd pleaser for sure!\"", "ingredients": ["1/2 cup butter, softened", "1/2 cup shortening", "1 1/2 cups white sugar", "2 eggs", "2 teaspoons vanilla extract", "2 3/4 cups all-purpose flour", "2 teaspoons cream of tartar", "1 teaspoon baking soda", "1/4 teaspoon salt", "2 tablespoons white sugar", "2 teaspoons ground cinnamon"], "url": "http://allrecipes.com/recipe/10687/mrs-siggs-snickerdoodles/", "image": null, "cookTime": "PT10M", "recipeYield": "48", "recipeInstructions": ["Preheat oven to 400 degrees F (200 degrees C).", "Cream together butter, shortening, 1 1/2 cups sugar, the eggs and the vanilla. Blend in the flour, cream of tartar, soda and salt. Shape dough by rounded spoonfuls into balls.", "Mix the 2 tablespoons sugar and the cinnamon. Roll balls of dough in mixture. Place 2 inches apart on ungreased baking sheets.", "Bake 8 to 10 minutes, or until set but not too hard. Remove immediately from baking sheets."], "prepTime": "PT20M", "name": "Mrs. Sigg's Snickerdoodles"}
{"totalTime": "PT55M", "description": "\"This is my grandmother's cornbread recipe and it's the best - sweet and moist!\"", "ingredients": ["1/2 cup butter", "2/3 cup white sugar", "2 eggs", "1 cup buttermilk", "1/2 teaspoon baking soda", "1 cup cornmeal", "1 cup all-purpose flour", "1/2 teaspoon salt"], "url": "http://allrecipes.com/recipe/76594/grandmothers-buttermilk-cornbread/", "image": null, "cookTime": "PT40M", "recipeYield": "9", "recipeInstructions": ["Preheat oven to 375 degrees F (175 degrees C). Grease an 8 inch square pan.", "Melt butter in large skillet. Remove from heat and stir in sugar. Quickly add eggs and beat until well blended. Combine buttermilk with baking soda and stir into mixture in pan. Stir in cornmeal, flour, and salt until well blended and few lumps remain. Pour batter into the prepared pan.", "Bake in the preheated oven for 30 to 40 minutes, or until a toothpick inserted in the center comes out clean."], "prepTime": "PT15M", "name": "Grandmother's Buttermilk Cornbread"}
{"totalTime": "PT50M", "description": "\"Very flavorful alternative to black beans and rice. Quinoa is a nutty grain from South America.\"", "ingredients": ["1 teaspoon vegetable oil", "1 onion, chopped", "3 cloves garlic, chopped", "3/4 cup quinoa", "1 1/2 cups vegetable broth", "1 teaspoon ground cumin", "1/4 teaspoon cayenne pepper", "salt and ground black pepper to taste", "1 cup frozen corn kernels", "2 (15 ounce) cans black beans, rinsed and drained", "1/2 cup chopped fresh cilantro"], "url": "http://allrecipes.com/recipe/49552/quinoa-and-black-beans/", "image": null, "cookTime": "PT35M", "recipeYield": "10", "recipeInstructions": ["Heat oil in a saucepan over medium heat; cook and stir onion and garlic until lightly browned, about 10 minutes.", "Mix quinoa into onion mixture and cover with vegetable broth; season with cumin, cayenne pepper, salt, and pepper. Bring the mixture to a boil. Cover, reduce heat, and simmer until quinoa is tender and broth is absorbed, about 20 minutes.", "Stir frozen corn into the saucepan, and continue to simmer until heated through, about 5 minutes; mix in the black beans and cilantro."], "prepTime": "PT15M", "name": "Quinoa and Black Beans"}
{"totalTime": "PT55M", "description": "\"I modified Beatrice's Excellent Oatmeal cookies very slightly. I came up with something that my boyfriend went CRAZY over! I've never seen him enjoy cookies to that extent! He said I blew his mother's recipe away.\"", "ingredients": ["1 cup butter, softened", "1 cup packed light brown sugar", "1/2 cup white sugar", "2 eggs", "2 teaspoons vanilla extract", "1 1/4 cups all-purpose flour", "1/2 teaspoon baking soda", "1 teaspoon salt", "3 cups quick-cooking oats", "1 cup chopped walnuts", "1 cup semisweet chocolate chips"], "url": "http://allrecipes.com/recipe/24445/chewy-chocolate-chip-oatmeal-cookies/", "image": null, "cookTime": "PT12M", "recipeYield": "42", "recipeInstructions": ["Preheat the oven to 325 degrees F (165 degrees C).", "In a large bowl, cream together the butter, brown sugar, and white sugar until smooth. Beat in eggs one at a time, then stir in vanilla. Combine the flour, baking soda, and salt; stir into the creamed mixture until just blended. Mix in the quick oats, walnuts, and chocolate chips. Drop by heaping spoonfuls onto ungreased baking sheets.", "Bake for 12 minutes in the preheated oven. Allow cookies to cool on baking sheet for 5 minutes before transferring to a wire rack to cool completely."], "prepTime": "PT15M", "name": "Chewy Chocolate Chip Oatmeal Cookies"}
{"totalTime": "PT2H30M", "description": "\"I got this recipe from a friend. It is very easy, and doesn't take long to make.\"", "ingredients": ["2 cups warm water (110 degrees F/45 degrees C)", "2/3 cup white sugar", "1 1/2 tablespoons active dry yeast", "1 1/2 teaspoons salt", "1/4 cup vegetable oil", "6 cups bread flour"], "url": "http://allrecipes.com/recipe/6788/amish-white-bread/", "image": null, "cookTime": "PT40M", "recipeYield": "24", "recipeInstructions": ["In a large bowl, dissolve the sugar in warm water, and then stir in yeast. Allow to proof until yeast resembles a creamy foam.", "Mix salt and oil into the yeast. Mix in flour one cup at a time. Knead dough on a lightly floured surface until smooth. Place in a well oiled bowl, and turn dough to coat. Cover with a damp cloth. Allow to rise until doubled in bulk, about 1 hour.", "Punch dough down. Knead for a few minutes, and divide in half. Shape into loaves, and place into two well oiled 9x5 inch loaf pans. Allow to rise for 30 minutes, or until dough has risen 1 inch above pans.", "Bake at 350 degrees F (175 degrees C) for 30 minutes."], "prepTime": "PT20M", "name": "Amish White Bread"}
{"totalTime": "PT1H50M", "description": "\"This recipe yields a crust that is soft and doughy on the inside and slightly crusty on the outside. Cover it with your favorite sauce and topping to make a delicious pizza.\"", "ingredients": ["2 1/4 teaspoons active dry yeast", "1/2 teaspoon brown sugar", "1 1/2 cups warm water (110 degrees F/45 degrees C)", "1 teaspoon salt", "2 tablespoons olive oil", "3 1/3 cups all-purpose flour"], "url": "http://allrecipes.com/recipe/7245/jays-signature-pizza-crust/", "image": null, "cookTime": "PT20M", "recipeYield": "15", "recipeInstructions": ["In a large bowl, dissolve the yeast and brown sugar in the water, and let sit for 10 minutes.", "Stir the salt and oil into the yeast solution. Mix in 2 1/2 cups of the flour.", "Turn dough out onto a clean, well floured surface, and knead in more flour until the dough is no longer sticky. Place the dough into a well oiled bowl, and cover with a cloth. Let the dough rise until double; this should take about 1 hour. Punch down the dough, and form a tight ball. Allow the dough to relax for a minute before rolling out. Use for your favorite pizza recipe.", "Preheat oven to 425 degrees F (220 degrees C). If you are baking the dough on a pizza stone, you may place your toppings on the dough, and bake immediately. If you are baking your pizza in a pan, lightly oil the pan, and let the dough rise for 15 or 20 minutes before topping and baking it.", "Bake pizza in preheated oven, until the cheese and crust are golden brown, about 15 to 20 minutes."], "prepTime": "PT30M", "name": "Jay's Signature Pizza Crust"}
{"totalTime": "PT1H10M", "description": "\"I know, you're probably thinking, 'Oh no! Another banana bread recipe!' But this one is a little different: the sour cream makes this one so moist it melts in your mouth. The flavor is just wonderful!  This one is great for gift giving and holidays. Loaves freeze well.\"", "ingredients": ["1/4 cup white sugar", "1 teaspoon ground cinnamon", "3/4 cup butter", "3 cups white sugar", "3 eggs", "6 very ripe bananas, mashed", "1 (16 ounce) container sour cream", "2 teaspoons vanilla extract", "2 teaspoons ground cinnamon", "1/2 teaspoon salt", "3 teaspoons baking soda", "4 1/2 cups all-purpose flour", "1 cup chopped walnuts (optional)"], "url": "http://allrecipes.com/recipe/6984/banana-sour-cream-bread/", "image": null, "cookTime": "PT1H", "recipeYield": "32", "recipeInstructions": ["Preheat oven to 300 degrees F (150 degrees C). Grease four 7x3 inch loaf pans. In a small bowl, stir together 1/4 cup white sugar and 1 teaspoon cinnamon. Dust pans lightly with cinnamon and sugar mixture.", "In a large bowl, cream butter and 3 cups sugar. Mix in eggs, mashed bananas, sour cream, vanilla and cinnamon. Mix in salt, baking soda and flour. Stir in nuts.  Divide into prepared pans.", "Bake for 1 hour, until a toothpick inserted in center comes out clean."], "prepTime": "PT10M", "name": "Banana Sour Cream Bread"}
{"totalTime": "PT45M", "description": "\"This tangy, creamy dip tastes just like Buffalo chicken wings. It's best served hot with crackers and celery sticks. Everyone loves the results!\"", "ingredients": ["2 (10 ounce) cans chunk chicken, drained", "2 (8 ounce) packages cream cheese, softened", "1 cup Ranch dressing", "3/4 cup pepper sauce (such as Frank's Red Hot®)", "1 1/2 cups shredded Cheddar cheese", "1 bunch celery, cleaned and cut into 4 inch pieces", "1 (8 ounce) box chicken-flavored crackers"], "url": "http://allrecipes.com/recipe/68461/buffalo-chicken-dip/", "image": null, "cookTime": "PT40M", "recipeYield": "20", "recipeInstructions": ["Heat chicken and hot sauce in a skillet over medium heat, until heated through. Stir in cream cheese and ranch dressing. Cook, stirring until well blended and warm. Mix in half of the shredded cheese, and transfer the mixture to a slow cooker. Sprinkle the remaining cheese over the top, cover, and cook on Low setting until hot and bubbly. Serve with celery sticks and crackers."], "prepTime": "PT5M", "name": "Buffalo Chicken Dip"}
{"totalTime": "PT1H", "description": "\"This is the best and most delicious salmon recipe, and very easy to prepare. I love maple in everything and put this together one night. My husband totally loved it; he did not like salmon that much until he had this.\"", "ingredients": ["1/4 cup maple syrup", "2 tablespoons soy sauce", "1 clove garlic, minced", "1/4 teaspoon garlic salt", "1/8 teaspoon ground black pepper", "1 pound salmon"], "url": "http://allrecipes.com/recipe/51283/maple-salmon/", "image": null, "cookTime": "PT20M", "recipeYield": "4", "recipeInstructions": ["In a small bowl, mix the maple syrup, soy sauce, garlic, garlic salt, and pepper.", "Place salmon in a shallow glass baking dish, and coat with the maple syrup mixture. Cover the dish, and marinate salmon in the refrigerator 30 minutes, turning once.", "Preheat oven to 400 degrees F (200 degrees C).", "Place the baking dish in the preheated oven, and bake salmon uncovered 20 minutes, or until easily flaked with a fork."], "prepTime": "PT10M", "name": "Maple Salmon"}
{"totalTime": "PT2H", "description": "\"This is my husband's favorite dish, and he considers it a special occasion every time I make it. The creamy cheese sauce and the tender potatoes in this classic French dish combine to make a deliciously addictive experience. It's a great side dish with a roast pork loin or beef tenderloin. Add a green salad and French bread, and you have found the magic path to a man's heart. To avoid lumps in your sauce, add the milk just a little at a time as you stir the flour and butter. Experiment with different cheeses for variety.\"", "ingredients": ["4 russet potatoes, sliced into 1/4 inch slices", "1 onion, sliced into rings", "salt and pepper to taste", "3 tablespoons butter", "3 tablespoons all-purpose flour", "1/2 teaspoon salt", "2 cups milk", "1 1/2 cups shredded Cheddar cheese"], "url": "http://allrecipes.com/recipe/15925/creamy-au-gratin-potatoes/", "image": null, "cookTime": "PT1H30M", "recipeYield": "4", "recipeInstructions": ["Preheat oven to 400 degrees F (200 degrees C). Butter a 1 quart casserole dish.", "Layer 1/2 of the potatoes into bottom of the prepared casserole dish. Top with the onion slices, and add the remaining potatoes. Season with salt and pepper to taste.", "In a medium-size saucepan, melt butter over medium heat. Mix in the flour and salt, and stir constantly with a whisk for one minute. Stir in milk. Cook until mixture has thickened. Stir in cheese all at once, and continue stirring until melted, about 30 to 60 seconds. Pour cheese over the potatoes, and cover the dish with aluminum foil.", "Bake 1 1/2 hours in the preheated oven."], "prepTime": "PT30M", "name": "Creamy Au Gratin Potatoes"}
{"totalTime": "PT1H10M", "description": "\"This is the moistest banana bread that I have ever tasted. It's also very easy to make!\"", "ingredients": ["1/2 cup butter, melted", "1 cup white sugar", "2 eggs", "1 teaspoon vanilla extract", "1 1/2 cups all-purpose flour", "1 teaspoon baking soda", "1/2 teaspoon salt", "1/2 cup sour cream", "1/2 cup chopped walnuts", "2 medium bananas, sliced"], "url": "http://allrecipes.com/recipe/17066/janets-rich-banana-bread/", "image": null, "cookTime": "PT1H", "recipeYield": "15", "recipeInstructions": ["Preheat oven to 350 degrees F (175 degrees C). Grease a 9x5 inch loaf pan.", "In a large bowl, stir together the melted butter and sugar. Add the eggs and vanilla, mix well. Combine the flour, baking soda and salt, stir into the butter mixture until smooth. Finally, fold in the sour cream, walnuts and bananas. Spread evenly into the prepared pan.", "Bake at 350 degrees F (175 degrees C) for 60 minutes, or until a toothpick inserted into the center of the loaf comes out clean. Cool loaf in the pan for 10 minutes before removing to a wire rack to cool completely."], "prepTime": "PT10M", "name": "Janet's Rich Banana Bread"}
{"totalTime": "PT30M", "description": "\"A delicious, classic chicken dish -- lightly coated chicken breasts braised with Marsala wine and mushrooms. Easy and ideal for both a quick weeknight entree AND serving to company.\"", "ingredients": ["1/4 cup all-purpose flour for coating", "1/2 teaspoon salt", "1/4 teaspoon ground black pepper", "1/2 teaspoon dried oregano", "4 skinless, boneless chicken breast halves - pounded 1/4 inch thick", "4 tablespoons butter", "4 tablespoons olive oil", "1 cup sliced mushrooms", "1/2 cup Marsala wine", "1/4 cup cooking sherry"], "url": "http://allrecipes.com/recipe/8887/chicken-marsala/", "image": null, "cookTime": "PT20M", "recipeYield": "4", "recipeInstructions": ["In a shallow dish or bowl, mix together the flour, salt, pepper and oregano. Coat chicken pieces in flour mixture.", "In a large skillet, melt butter in oil over medium heat. Place chicken in the pan, and lightly brown.  Turn over chicken pieces, and add mushrooms. Pour in wine and sherry.  Cover skillet; simmer chicken 10 minutes, turning once, until no longer pink and juices run clear."], "prepTime": "PT10M", "name": "Chicken Marsala"}
{"totalTime": "PT1H10M", "description": "\"This is a very easy and no fail recipe for meatloaf. It won't take long to make at all, and it's quite good!\"", "ingredients": ["1 1/2 pounds ground beef", "1 egg", "1 onion, chopped", "1 cup milk", "1 cup dried bread crumbs", "salt and pepper to taste", "2 tablespoons brown sugar", "2 tablespoons prepared mustard", "1/3 cup ketchup"], "url": "http://allrecipes.com/recipe/16354/easy-meatloaf/", "image": null, "cookTime": "PT1H", "recipeYield": "8", "recipeInstructions": ["Preheat oven to 350 degrees F (175 degrees C).", "In a large bowl, combine the beef, egg, onion, milk and bread OR cracker crumbs. Season with salt and pepper to taste and place in a lightly greased 5x9 inch loaf pan, OR form into a loaf and place in a lightly greased 9x13 inch baking dish.", "In a separate small bowl, combine the brown sugar, mustard and ketchup. Mix well and pour over the meatloaf.", "Bake at 350 degrees F (175 degrees C) for 1 hour."], "prepTime": "PT10M", "name": "Easy Meatloaf"}
{"totalTime": "PT45M", "description": "\"A great way to use leftover chicken. Even kids love these!\"", "ingredients": ["1 tablespoon butter", "1/2 cup chopped green onions", "1/2 teaspoon garlic powder", "1 (4 ounce) can diced green chiles", "1 (10.75 ounce) can condensed cream of mushroom soup", "1/2 cup sour cream", "1 1/2 cups cubed cooked chicken breast meat", "1 cup shredded Cheddar cheese, divided", "6 (12 inch) flour tortillas", "1/4 cup milk"], "url": "http://allrecipes.com/recipe/8694/chicken-enchiladas-ii/", "image": null, "cookTime": "PT30M", "recipeYield": "6", "recipeInstructions": ["Preheat oven to 350 degrees F (175 degrees C). Lightly grease a large baking dish.", "In a medium saucepan over medium heat, melt the butter and saute the green onion until tender (about 3 to 4 minutes). Add the garlic powder, then stir in the green chiles, cream of mushroom soup and sour cream. Mix well. Reserve 3/4 of this sauce and set aside. To the remaining 1/4 of the sauce in the saucepan, add the chicken and 1/2 cup of shredded Cheddar cheese. Stir together.", "Fill each flour tortilla with the chicken mixture and roll up. Place seam side down in the prepared baking dish.", "In a small bowl combine the reserved 3/4 of the sauce with the milk. Spoon this mixture over the rolled tortillas and top with the remaining 1/2 cup of shredded Cheddar cheese. Bake in the preheated oven for 30 to 35 minutes, or until cheese is bubbly."], "prepTime": "PT15M", "name": "Chicken Enchiladas II"}
{"totalTime": "PT4H45M", "description": "\"This is so easy and very tasty. Serve on buns with French fries or potato chips.\"", "ingredients": ["1 (14 ounce) can beef broth", "3 pounds boneless pork ribs", "1 (18 ounce) bottle barbeque sauce"], "url": "http://allrecipes.com/recipe/21174/bbq-pork-for-sandwiches/", "image": null, "cookTime": "PT4H30M", "recipeYield": "12", "recipeInstructions": ["Pour can of beef broth into slow cooker, and add boneless pork ribs. Cook on High heat for 4 hours, or until meat shreds easily. Remove meat, and shred with two forks. It will seem that it's not working right away, but it will.", "Preheat oven to 350 degrees F (175 degrees C). Transfer the shredded pork to a Dutch oven or iron skillet, and stir in barbeque sauce.", "Bake in the preheated oven for 30 minutes, or until heated through."], "prepTime": "PT15M", "name": "BBQ Pork for Sandwiches"}
{"totalTime": "PT40M", "description": "\"This recipe has been in my family for years. It's easy to cook, but tastes like it took hours to make! I usually make enough extra sauce to pour over mashed potatoes. YUM!\"", "ingredients": ["1 (10.5 ounce) can condensed French onion soup", "1 1/2 pounds ground beef", "1/2 cup dry bread crumbs", "1 egg", "1/4 teaspoon salt", "1/8 teaspoon ground black pepper", "1 tablespoon all-purpose flour", "1/4 cup ketchup", "1/4 cup water", "1 tablespoon Worcestershire sauce", "1/2 teaspoon mustard powder"], "url": "http://allrecipes.com/recipe/14595/salisbury-steak/", "image": null, "cookTime": "PT20M", "recipeYield": "6", "recipeInstructions": ["In a large bowl, mix together 1/3 cup condensed French onion soup with ground beef, bread crumbs, egg, salt and black pepper. Shape into 6 oval patties.", "In a large skillet over medium-high heat, brown both sides of patties. Pour off excess fat.", "In a small bowl, blend flour and remaining soup until smooth. Mix in ketchup, water, Worcestershire sauce and mustard powder. Pour over meat in skillet. Cover, and cook for 20 minutes, stirring occasionally."], "prepTime": "PT20M", "name": "Salisbury Steak"}
{"totalTime": "PT45M", "description": "\"This recipe will produce the biggest biscuits in the history of the world! Serve these gems with butter, preserves, honey, gravy or they can also be used as dinner rolls...you get the picture. The dough can also be prepared several hours, and up to a day ahead of time. If so, turn dough out onto aluminum foil that has been either floured, lightly buttered or lightly sprayed with cooking spray. Roll up foil until it is sealed, and refrigerate.  Don't be surprised if your biscuits rise even higher because the baking powder has had more time to act in the dough. You may have to make a few batches before you get desired results: desired results equals huge mongo biscuits.\"", "ingredients": ["2 cups all-purpose flour", "1 tablespoon baking powder", "1 teaspoon salt", "1 tablespoon white sugar", "1/3 cup shortening", "1 cup milk"], "url": "http://allrecipes.com/recipe/7040/jps-big-daddy-biscuits/", "image": null, "cookTime": "PT15M", "recipeYield": "6", "recipeInstructions": ["Preheat oven to 425 degrees F (220 degrees C).", "In a large bowl, whisk together the flour, baking powder, salt, and sugar. Cut in the shortening until the mixture resembles coarse meal. Gradually stir in milk until dough pulls away from the side of the bowl.", "Turn out onto a floured surface, and knead 15 to 20 times. Pat or roll dough out to 1 inch thick. Cut biscuits with a large cutter or juice glass dipped in flour. Repeat until all dough is used. Brush off the excess flour, and place biscuits onto an ungreased baking sheet.", "Bake for 13 to 15 minutes in the preheated oven, or until edges begin to brown."], "prepTime": "PT30M", "name": "J.P.'s Big Daddy Biscuits"}
{"totalTime": "PT1H", "description": "\"This is a lot like a lasagna, only Mexican-style! Serve like a pie and garnish with sour cream, salsa, lettuce and tomato. Make sure you like spicy foods before trying this one. It's hot!\"", "ingredients": ["2 pounds ground beef", "1 onion, chopped", "2 teaspoons minced garlic", "1 (2 ounce) can black olives, sliced", "1 (4 ounce) can diced green chili peppers", "1 (10 ounce) can diced tomatoes with green chile peppers", "1 (16 ounce) jar taco sauce", "2 (16 ounce) cans refried beans", "12 (8 inch) flour tortillas", "9 ounces shredded Colby cheese"], "url": "http://allrecipes.com/recipe/16881/burrito-pie/", "image": null, "cookTime": "PT30M", "recipeYield": "16", "recipeInstructions": ["Preheat oven to 350 degrees F (175 degrees C).", "In a large skillet over medium heat, saute the ground beef for 5 minutes. Add the onion and garlic, and saute for 5 more minutes. Drain any excess fat, if desired. Mix in the olives, green chile peppers, tomatoes with green chile peppers, taco sauce and refried beans. Stir mixture thoroughly, reduce heat to low, and let simmer for 15 to 20 minutes.", "Spread a thin layer of the meat mixture in the bottom of a 4 quart casserole dish. Cover with a layer of tortillas followed by more meat mixture, then a layer of cheese. Repeat tortilla, meat, cheese pattern until all the tortillas are used, topping off with a layer of meat mixture and cheese.", "Bake for 20 to 30 minutes in the preheated oven, or until cheese is slightly brown and bubbly."], "prepTime": "PT30M", "name": "Burrito Pie"}
{"totalTime": "PT8H10M", "description": "\"This is an easy variation of a favorite. I used to prepare it the traditional way, with sour cream, but I didn't have any one night, so I used cream cheese instead. My husband and I liked it even better! Serve over hot, cooked egg noodles or rice.\"", "ingredients": ["1 pound cubed beef stew meat", "1 (10.75 ounce) can condensed golden mushroom soup", "1/2 cup chopped onion", "1 tablespoon Worcestershire sauce", "1/4 cup water", "4 ounces cream cheese"], "url": "http://allrecipes.com/recipe/16352/slow-cooker-beef-stroganoff-i/", "image": null, "cookTime": "PT8H", "recipeYield": "4", "recipeInstructions": ["In a slow cooker, combine the meat, soup, onion, Worcestershire sauce and water.", "Cook on Low setting for 8 hours, or on High setting for about 5 hours. Stir in cream cheese just before serving."], "prepTime": "PT10M", "name": "Slow Cooker Beef Stroganoff I"}
{"totalTime": "PT12H20M", "description": "\"A hearty, savory slow cooker stew with potatoes, carrots, celery, broth, herbs and spices. You won't be slow to say 'yum'!\"", "ingredients": ["2 pounds beef stew meat, cut into 1 inch cubes", "1/4 cup all-purpose flour", "1/2 teaspoon salt", "1/2 teaspoon ground black pepper", "1 clove garlic, minced", "1 bay leaf", "1 teaspoon paprika", "1 teaspoon Worcestershire sauce", "1 onion, chopped", "1 1/2 cups beef broth", "3 potatoes, diced", "4 carrots, sliced", "1 stalk celery, chopped"], "url": "http://allrecipes.com/recipe/14685/slow-cooker-beef-stew-i/", "image": null, "cookTime": "PT12H", "recipeYield": "6", "recipeInstructions": ["Place meat in slow cooker. In a small bowl mix together the flour, salt, and pepper; pour over meat, and stir to coat meat with flour mixture. Stir in the garlic, bay leaf, paprika, Worcestershire sauce, onion, beef broth, potatoes, carrots, and celery.", "Cover, and cook on Low setting for 10 to 12 hours, or on High setting for 4 to 6 hours."], "prepTime": "PT20M", "name": "Slow Cooker Beef Stew I"}
{"totalTime": "PT2H", "description": "\"These oatmeal cookies are very moist with a good flavor. Add a cup of raisins or nuts if you desire.\"", "ingredients": ["1 cup butter, softened", "1 cup white sugar", "1 cup packed brown sugar", "2 eggs", "1 teaspoon vanilla extract", "2 cups all-purpose flour", "1 teaspoon baking soda", "1 teaspoon salt", "1 1/2 teaspoons ground cinnamon", "3 cups quick cooking oats"], "url": "http://allrecipes.com/recipe/19247/soft-oatmeal-cookies/", "image": null, "cookTime": "PT10M", "recipeYield": "24", "recipeInstructions": ["In a medium bowl, cream together butter, white sugar, and brown sugar. Beat in eggs one at a time, then stir in vanilla. Combine flour, baking soda, salt, and cinnamon; stir into the creamed mixture. Mix in oats. Cover, and chill dough for at least one hour.", "Preheat the oven to 375 degrees F (190 degrees C). Grease cookie sheets. Roll the dough into walnut sized balls, and place 2 inches apart on cookie sheets. Flatten each cookie with a large fork dipped in sugar.", "Bake for 8 to 10 minutes in preheated oven. Allow cookies to cool on baking sheet for 5 minutes before transferring to a wire rack to cool completely."], "prepTime": "PT15M", "name": "Soft Oatmeal Cookies"}
