{"totalTime": "PT1H10M", "description": "\"This is a very different banana bread recipe; it has chocolate chips, cocoa, and a touch of sour cream. Delicious!\"", "ingredients": ["1 cup margarine, softened", "2 cups white sugar", "4 eggs", "6 bananas, mashed", "2 teaspoons vanilla extract", "3 cups all-purpose flour", "2 teaspoons baking soda", "1/4 cup unsweetened cocoa powder", "1 cup lite sour cream", "1 cup semisweet chocolate chips"], "image": "http://images.media-allrecipes.com/userphotos/720x405/996152.jpg", "cookTime": "PT1H", "recipeYield": "24", "recipeInstructions": ["Preheat oven to 350 degrees F (175 degrees C). Lightly grease two 9x5 inch loaf pans.", "In a large bowl, cream together margarine, sugar and eggs. Stir in bananas and vanilla. Sift in flour, baking soda and cocoa; mix well. Blend in sour cream and chocolate chips. Pour batter into prepared pans.", "Bake in preheated oven for 60 minutes, or until a toothpick inserted into center of a loaf comes out clean."], "prepTime": "PT10M", "name": "Chocolate Banana Bread"}
{"totalTime": "PT2H30M", "description": "\"This cake was first made for me by a friend while I was visiting her after she had delivered her 11th child. I told her, 'I should have baked for you!'\"", "ingredients": ["3/4 cup butter", "2 1/8 cups white sugar", "3 eggs", "2 teaspoons vanilla extract", "3 cups all-purpose flour", "1 1/2 teaspoons baking soda", "1/4 teaspoon salt", "1 1/2 cups buttermilk", "2 teaspoons lemon juice", "1 1/2 cups mashed bananas", "1/2 cup butter, softened", "1 (8 ounce) package cream cheese, softened", "3 1/2 cups confectioners' sugar", "1 teaspoon vanilla extract"], "image": null, "cookTime": "PT1H", "recipeYield": "18", "recipeInstructions": ["Preheat oven to 275 degrees F (135 degrees C). Grease and flour a 9x13 inch pan. In a small bowl, mix mashed bananas with lemon juice, set aside. In a medium bowl, mix flour, baking soda and salt. Set aside.", "In a large bowl, cream 3/4 cup butter and 2 1/8 cups sugar until light and fluffy. Beat in the eggs one at a time, then stir in 2 teaspoons vanilla.  Beat in the flour mixture alternately with the buttermilk. Stir in banana mixture. Pour batter into prepared pan.", "Bake in preheated oven for 1 hour, or until a toothpick inserted into the center of the cake comes out clean. Remove from oven and place directly into freezer for 45 minutes. This will make the cake very moist.", "For the frosting: In a large bowl, cream 1/2 cup butter and cream cheese until smooth. Beat in 1 teaspoon vanilla. Add confectioners sugar and beat on low speed until combined, then on high until frosting is smooth. Spread on cooled cake."], "prepTime": "PT30M", "name": "Banana Cake VI"}
{"totalTime": "", "description": "\"This recipe makes a delightful banana cake packed with chocolate chips for a delightful way to enjoy a classic flavor combination.\"", "ingredients": ["1 1/2 cups all-purpose flour", "2/3 cup white sugar", "1 1/2 teaspoons baking powder", "1/4 teaspoon salt", "1 cup mashed bananas", "1 egg", "1/2 cup unsalted butter, melted", "1/4 cup milk", "3/4 cup semisweet chocolate chips"], "image": "http://images.media-allrecipes.com/userphotos/720x405/424473.jpg", "cookTime": "", "recipeYield": "24", "recipeInstructions": ["Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9x13 inch pan.", "In a large bowl, mix flour, sugar, baking powder and salt.", "In a separate bowl, combine bananas, egg, melted butter and milk.", "Stir banana mixture into flour mixture until blended. Be careful not to over mix.", "Stir in chocolate chips.", "Pour batter into 9x13 inch pan. Bake at 350 degrees F (175 degrees C) 30 to 35 minutes, or until a toothpick inserted into center of cake comes out clean. (It will have some melted chocolate, but no crumbs.)"], "prepTime": "", "name": "Banana Chocolate Chip Cake"}
{"totalTime": "PT1H20M", "description": "\"Browning the butter really adds a depth of flavor, not to mention it smells extra amazing when in the oven. This is my go-to recipe when I have ripe bananas, and has taken me a while to get it right. Enjoy it hot, fresh from the oven.\"", "ingredients": ["1/2 cup butter", "3 very ripe bananas", "1/4 cup brown sugar", "1/4 cup white sugar", "1 egg", "1 tablespoon vanilla extract", "1 1/2 cups all-purpose flour", "1 1/2 teaspoons baking soda", "1 teaspoon ground cinnamon (optional)", "1/2 teaspoon ground nutmeg (optional)"], "image": "http://images.media-allrecipes.com/userphotos/720x405/2253133.jpg", "cookTime": "PT50M", "recipeYield": "6", "recipeInstructions": ["Melt butter in a small saucepan over medium heat; bring to a low simmer and cook, stirring frequently, until butter is browned, fragrant, and foamy, with brown bits in it, 5 to 10 minutes. Set aside to cool to room temperature, about 15 minutes. Measure 1/3 cup of browned butter; reserve remaining browned butter for another use.", "Preheat oven to 350 degrees F (175 degrees C). Grease a loaf pan.", "Mash bananas in a large bowl; stir in brown sugar, white sugar, egg, vanilla extract, and 1/3 cup brown butter.", "Whisk flour, baking soda, cinnamon, and nutmeg together in a bowl. Fold flour mixture into banana mixture just until all ingredients are moistened; pour into prepared pan.", "Bake in the preheated oven until a toothpick inserted near the center comes out clean, about 45 minutes."], "prepTime": "PT15M", "name": "Browned Butter Banana Bread"}
